Revit 2027 API
IExternalDBApplication.OnShutdown Method
Implement this method to execute some tasks when Autodesk Revit shuts down.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
ExternalDBApplicationResult OnShutdown(
	ControlledApplication application
)
Function OnShutdown (
	application As ControlledApplication
) As ExternalDBApplicationResult
ExternalDBApplicationResult OnShutdown(
	ControlledApplication^ application
)
abstract OnShutdown :
        application : ControlledApplication -> ExternalDBApplicationResult
Parameters
application ControlledApplication
 Handle to the Revit Application object.
Return Value
ExternalDBApplicationResult
Indicates if the external db application completes its work successfully.
See Also
Reference
IExternalDBApplication Interface
Autodesk.Revit.DB Namespace